docs/site/20250314134201-festival_of_excellence_2025.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>festival of excellence 2025</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">festival of excellence 2025</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc3693d3">Historical Overview (7 min)</a>
<ul>
<li><a href="#orgd84eda6">Music Pre-1870s</a></li>
<li><a href="#org9c739e5">Invention of the phonograph</a></li>
<li><a href="#org8831cff">Synthesis and electronic instruments</a></li>
<li><a href="#org796cf5b">Emergence of performers with tape</a></li>
<li><a href="#org8519496">Real Time Synthesis</a></li>
<li><a href="#orgf59fdc7">Computers and MIDI</a></li>
<li><a href="#orgb24266e">Programming Languages</a></li>
<li><a href="#orgcb0d425">Quote of definition</a></li>
</ul>
</li>
<li><a href="#org8566da2">Differing Defintions of Interactivity</a>
<ul>
<li><a href="#org9b2e8a2">Mcnutt</a></li>
</ul>
</li>
<li><a href="#org6ea61f5">Interactive Music Systems</a>
<ul>
<li><a href="#org1e86846">Winkler</a></li>
<li><a href="#orgf230523">Rowe</a>
<ul>
<li><a href="#orgfc4ae05">Dimensions</a></li>
<li><a href="#orgdb07442">Response</a></li>
<li><a href="#org9ce8dbb">Paradigms</a></li>
</ul>
</li>
<li><a href="#org83a53a0">Conceptualizations (feron - probably redundant)</a>
<ul>
<li><a href="#org78bb974">Human vs machine</a></li>
<li><a href="#org57fb7bb">Time-space transgressions. Impossible Instrument</a></li>
<li><a href="#org1f3352f">Chamber Music Interaction</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd53d566">Examples (30 min)</a>
<ul>
<li><a href="#orgb34a051">Concatenation by Rand Steiger (13 min)</a></li>
<li><a href="#org66eff26">Manteia by Peter Van Zandt Lane (10 min for Pyro and Chrono)</a></li>
<li><a href="#org26850e8">Ripped Up Maps by Andrew May (Whatever it needs to be)</a></li>
<li><a href="#orgd330a9d">Table</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc3693d3" class="outline-2">
<h2 id="orgc3693d3">Historical Overview (7 min)</h2>
<div class="outline-text-2" id="text-orgc3693d3">
</div>
<div id="outline-container-orgd84eda6" class="outline-3">
<h3 id="orgd84eda6">Music Pre-1870s</h3>
<div class="outline-text-3" id="text-orgd84eda6">
<p>
Music is performed by humans, using mechanical instruments, and the only way to consume this music is to play it or listen to someone playing it live.
</p>
</div>
</div>
<div id="outline-container-org9c739e5" class="outline-3">
<h3 id="org9c739e5">Invention of the phonograph</h3>
<div class="outline-text-3" id="text-org9c739e5">
<p>
Phonograph and recorded sound is invented in 1870s. Music making process is ruptured: At first, it is just the timing aspect that is ruptured. You can listen to humans playing mechanical instruments whenever you want. It also creates the quest for perfection.
</p>
</div>
</div>
<div id="outline-container-org8831cff" class="outline-3">
<h3 id="org8831cff">Synthesis and electronic instruments</h3>
<div class="outline-text-3" id="text-org8831cff">
<p>
As technology develops, synthesis ruptures the causality aspect of performance. Composers can create the perfect version of music that is synthesized with exactness. However, many audience members find they don't want to sit in a concert hall and listen to a recording. Despite the creation by a human composer, the lack of a human performer is distrubing some. Electronic instruments also contribute to this, as the sounds created by synthesis are not always reproducible by acoustic instruments.
</p>
</div>
</div>
<div id="outline-container-org796cf5b" class="outline-3">
<h3 id="org796cf5b">Emergence of performers with tape</h3>
<div class="outline-text-3" id="text-org796cf5b">
<p>
In the 1960s, in an effort to bring back the human element of music performance, composers begin writing pieces for human performers with "tape" or fixed media. This brings back a lot of what was missing in electronic music. There is still something about a human performer that appeals to a human audience.
</p>

<p>
The problem is that the human performer is often put in very stressful performance situations. "Tape prison" or the inability for a human to interpret the performance because of synchronization with the tape still is missing part of the human element of music performance. 
</p>
</div>
</div>
<div id="outline-container-org8519496" class="outline-3">
<h3 id="org8519496">Real Time Synthesis</h3>
<div class="outline-text-3" id="text-org8519496">
<p>
The invention of synthesizers allows for some more real time synthesis and interaction between the human and the electronic.
</p>
</div>
</div>
<div id="outline-container-orgf59fdc7" class="outline-3">
<h3 id="orgf59fdc7">Computers and MIDI</h3>
<div class="outline-text-3" id="text-orgf59fdc7">
<p>
In the 1980s as computers come into play, and the MIDI language for communication, performers are able to break out of the tape prison. Some elements can be controlled in real time in performance and be different in every performance. 
</p>
</div>
</div>
<div id="outline-container-orgb24266e" class="outline-3">
<h3 id="orgb24266e">Programming Languages</h3>
<div class="outline-text-3" id="text-orgb24266e">
<p>
Languages like Max, Pure Data, SuperCollider, and other languages emerge for easy audio programming, signal processing, and algorithmic composition.
</p>
</div>
</div>
<div id="outline-container-orgcb0d425" class="outline-3">
<h3 id="orgcb0d425">Quote of definition</h3>
<div class="outline-text-3" id="text-orgcb0d425">
<p>
<code>Interactive composition offers the combination of the best human qualities of a live performer (gestural nuance, stage presence, character) with the best machine qualities of a computer (infinite sound possibilities, instant processing, rapid calculations).</code>
</p>

<p>
<code>Electronics can extend the sound world of the live performer, while the performer can communicate musical understanding to an audience, eliminating the detachment and isolation of the typical electroacoustic performance.</code> (Yoder but quote is from garnett?)
</p>
</div>
</div>
</div>
<div id="outline-container-org8566da2" class="outline-2">
<h2 id="org8566da2">Differing Defintions of Interactivity</h2>
<div class="outline-text-2" id="text-org8566da2">
</div>
<div id="outline-container-org9b2e8a2" class="outline-3">
<h3 id="org9b2e8a2">Mcnutt</h3>
<div class="outline-text-3" id="text-org9b2e8a2">
<p>
Composers it's about input from a perfomer
Performers it's interaction with interfaces, instruments, microphones, etc. Also interacting with composers and audiences. And the invisible chamber music partner
</p>

<p>
Interactive computer music systems are those whose behavior changes in response to musical input - Rowe
</p>

<p>
<code>Interactive music is defined as music composition or improvisation where software interprets a live performance to affect music generated or modified by computers. Usually this involves a performer playing an instrument while a computer creates music that is in some way shaped by the performance.</code> - Winkler
</p>
</div>
</div>
</div>
<div id="outline-container-org6ea61f5" class="outline-2">
<h2 id="org6ea61f5">Interactive Music Systems</h2>
<div class="outline-text-2" id="text-org6ea61f5">
</div>
<div id="outline-container-org1e86846" class="outline-3">
<h3 id="org1e86846">Winkler</h3>
<div class="outline-text-3" id="text-org1e86846">
<ol class="org-ol">
<li>Human input, instruments - Human activity is translated into digital information and sent to the computer.</li>
<li>Computer listening, performance analysis - The computer receives the human input and analyzes the performance information for timing, pitch, dynamics, or other musical characteristics.</li>
<li>Interpretation - The software interprets the computer listener information, generating data that will influence the composition.</li>
<li>Computer composition - Computer processes, responsible for all aspects of the computer generated music, are based on the results of the computer's interpretation of the performance.</li>
<li>Sound generation and output, performance - The computer plays the music, using sounds created internally, or by sending musical information to devices that generate sound.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf230523" class="outline-3">
<h3 id="orgf230523">Rowe</h3>
<div class="outline-text-3" id="text-orgf230523">
</div>
<div id="outline-container-orgfc4ae05" class="outline-4">
<h4 id="orgfc4ae05">Dimensions</h4>
<div class="outline-text-4" id="text-orgfc4ae05">
</div>
<ul class="org-ul">
<li><a id="orge6ddf4c"></a>Score Driven<br />
<div class="outline-text-5" id="text-orge6ddf4c">
<p>
Stored fragments and predetermined event collections. 
</p>
</div>
</li>
<li><a id="org5398eca"></a>Performance Driven<br />
<div class="outline-text-5" id="text-org5398eca">
<p>
No predetermined fragments, stored representations
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgdb07442" class="outline-4">
<h4 id="orgdb07442">Response</h4>
<div class="outline-text-4" id="text-orgdb07442">
</div>
<ul class="org-ul">
<li><a id="orgdb14db4"></a>Transformative<br />
<div class="outline-text-5" id="text-orgdb14db4">
<p>
Existing material that is transformed to create variants. May not be recognizeable. 
</p>
</div>
</li>
<li><a id="org4e72c2f"></a>Generative<br />
<div class="outline-text-5" id="text-org4e72c2f">
<p>
Creating music from algorithms. 
</p>
</div>
</li>
<li><a id="orgd1e4ffd"></a>Sequenced<br />
<div class="outline-text-5" id="text-orgd1e4ffd">
<p>
Prerecorded fragments in response to real-time input. 
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org9ce8dbb" class="outline-4">
<h4 id="org9ce8dbb">Paradigms</h4>
<div class="outline-text-4" id="text-org9ce8dbb">
</div>
<ul class="org-ul">
<li><a id="orgab493c7"></a>Instrument Paradigm<br />
<div class="outline-text-5" id="text-orgab493c7">
<p>
Extending the musical instrument. 
</p>
</div>
</li>
<li><a id="orged7c0de"></a>Player Paradigm<br />
<div class="outline-text-5" id="text-orged7c0de">
<p>
An artificial player, musical presence with own personality. 
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org83a53a0" class="outline-3">
<h3 id="org83a53a0">Conceptualizations (feron - probably redundant)</h3>
<div class="outline-text-3" id="text-org83a53a0">
</div>
<div id="outline-container-org78bb974" class="outline-4">
<h4 id="org78bb974">Human vs machine</h4>
</div>
<div id="outline-container-org57fb7bb" class="outline-4">
<h4 id="org57fb7bb">Time-space transgressions. Impossible Instrument</h4>
</div>
<div id="outline-container-org1f3352f" class="outline-4">
<h4 id="org1f3352f">Chamber Music Interaction</h4>
</div>
</div>
</div>
<div id="outline-container-orgd53d566" class="outline-2">
<h2 id="orgd53d566">Examples (30 min)</h2>
<div class="outline-text-2" id="text-orgd53d566">
</div>
<div id="outline-container-orgb34a051" class="outline-3">
<h3 id="orgb34a051">Concatenation by Rand Steiger (13 min)</h3>
<div class="outline-text-3" id="text-orgb34a051">
<p>
This is score driven ,  transformative, and an instrument paradigm
</p>
</div>
</div>
<div id="outline-container-org66eff26" class="outline-3">
<h3 id="org66eff26">Manteia by Peter Van Zandt Lane (10 min for Pyro and Chrono)</h3>
<div class="outline-text-3" id="text-org66eff26">
<p>
Score driven, sequenced, player paradigm (pyromancer closer to instrument)
</p>
</div>
</div>
<div id="outline-container-org26850e8" class="outline-3">
<h3 id="org26850e8">Ripped Up Maps by Andrew May (Whatever it needs to be)</h3>
<div class="outline-text-3" id="text-org26850e8">
<p>
Performance driven, transformative, generative, and possibly sequenced, player paradigm
</p>
</div>
</div>
<div id="outline-container-orgd330a9d" class="outline-3">
<h3 id="orgd330a9d">Table</h3>
<div class="outline-text-3" id="text-orgd330a9d">
<p>
Score Based
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Instrument</td>
<td class="org-left">Player</td>
</tr>

<tr>
<td class="org-left">Transformative</td>
<td class="org-left">Concatenation</td>
<td class="org-left">Shoot the Well, Bassoonification</td>
</tr>

<tr>
<td class="org-left">Generative</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Obsessed Again? Brown Velvet, Reaction Reflection?</td>
</tr>

<tr>
<td class="org-left">Sequenced</td>
<td class="org-left">MANTEIA (pyro esp)</td>
<td class="org-left">MANTEIA, Gnarkill, Mask</td>
</tr>
</tbody>
</table>

<p>
Player Based
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Instrument</td>
<td class="org-left">Player</td>
</tr>

<tr>
<td class="org-left">Transformative</td>
<td class="org-left">Effects Pedal Improv Sim?</td>
<td class="org-left">RUM</td>
</tr>

<tr>
<td class="org-left">Generative</td>
<td class="org-left">N/A?</td>
<td class="org-left">RUM</td>
</tr>

<tr>
<td class="org-left">Sequenced</td>
<td class="org-left">N/A?</td>
<td class="org-left">RUM</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
